#  Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# # *Пример:*
# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

s = int(input('Введите общее количество журавликов: '))
if s % 6 == 0:
    petr = s // 6
    serg = s // 6
    kate = (petr + serg) * 2
    print(f'Петя - {petr} журавликов')
    print(f'Сережа - {serg} журавликов')
    print(f'Катя - {kate} журавликов')
else:
    print('С таким числом такого не может быть!!!')